In [1]:
import numpy as np
import pandas as pd

In [3]:
ser1 = pd.Series([1,2,3,4],['a','b','c','d'])
ser1

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
ser1[0]

1

In [5]:
ser1['a']

1

In [8]:
ser2 = pd.Series(np.arange(1,5),['a','b','c','d'])
ser2

a    1
b    2
c    3
d    4
dtype: int64

In [9]:
d = {'a': 1, 'b': 2, 'c': 3, 'd': 4}
ser3 = pd.Series(d)
ser3

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
from numpy.random import randn

df = pd.DataFrame(randn(3,4), ['Row1', 'Row2', 'Row3'], ['Col1', 'Col2', 'Col3', 'Col4'])
df

          Col1      Col2      Col3      Col4
Row1  1.484292 -0.801334  0.254765 -1.338280
Row2  0.273931 -1.405948 -2.700952 -0.461286
Row3 -0.134551  0.154978  0.711655  0.480209

In [15]:
len(df)

3

In [40]:
df['Col1']

Row1    0.433205
Row2    0.985195
Row3    0.341532
Name: Col1, dtype: float64

In [15]:
type(df['Col1'])

pandas.core.series.Series

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df[['Col1', 'Col2']]

          Col1      Col2
Row1  0.433205  0.909424
Row2  0.985195  0.905326
Row3  0.341532  0.562385

In [18]:
type(df[['Col1', 'Col2']])

pandas.core.frame.DataFrame

In [19]:
df['new'] = df['Col1'] + df['Col2']

In [20]:
df

          Col1      Col2      Col3      Col4       new
Row1  0.433205  0.909424  1.984212 -0.346964  1.342629
Row2  0.985195  0.905326 -1.564283 -0.575443  1.890521
Row3  0.341532  0.562385 -1.895464  0.734622  0.903918

In [24]:
df.drop('new', axis=1)

          Col1      Col2      Col3      Col4
Row1  0.433205  0.909424  1.984212 -0.346964
Row2  0.985195  0.905326 -1.564283 -0.575443
Row3  0.341532  0.562385 -1.895464  0.734622

In [25]:
df

          Col1      Col2      Col3      Col4       new
Row1  0.433205  0.909424  1.984212 -0.346964  1.342629
Row2  0.985195  0.905326 -1.564283 -0.575443  1.890521
Row3  0.341532  0.562385 -1.895464  0.734622  0.903918

In [27]:
df.loc['Row1']

Col1    0.433205
Col2    0.909424
Col3    1.984212
Col4   -0.346964
new     1.342629
Name: Row1, dtype: float64

In [28]:
type(df.loc['Row1'])

pandas.core.series.Series

In [29]:
df.iloc[0]

Col1    0.433205
Col2    0.909424
Col3    1.984212
Col4   -0.346964
new     1.342629
Name: Row1, dtype: float64

In [32]:
df.loc['Row1', 'Col1']

0.4332052382933605

In [34]:
df.iloc[0,0]

0.4332052382933605

In [35]:
df.loc[['Row1', 'Row2'], ['Col1', 'Col2']]

          Col1      Col2
Row1  0.433205  0.909424
Row2  0.985195  0.905326

In [38]:
# Unlike numpy array range, 'Stop' label is included in Dataframes. 
# Both 'start' and 'stop' labels are necessary

df.loc['Row1':'Row3', 'Col1':'Col3']

          Col1      Col2      Col3
Row1  0.433205  0.909424  1.984212
Row2  0.985195  0.905326 -1.564283
Row3  0.341532  0.562385 -1.895464

In [74]:
np.random.seed(101)

In [3]:
df = pd.DataFrame(np.random.randn(5,4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
df

          W         X         Y         Z
A  1.248199  0.282467  0.728076 -0.383810
B -1.100426  0.857818  0.680379 -0.775980
C  0.276657 -0.876517  0.112687  0.315180
D  0.971077  0.329252 -0.720245 -2.127827
E  0.646667 -1.562923  0.244163 -0.604688

In [49]:
df['new'] = df['W'] + df['X']

In [58]:
df.drop(columns='new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [69]:
df.loc[:,['W', 'X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [66]:
type(df.loc[['A', 'B'],['W', 'X']])

pandas.core.frame.DataFrame

In [76]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [77]:
df['Z']<0

A    False
B    False
C     True
D    False
E    False
Name: Z, dtype: bool

In [78]:
df[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [80]:
df.loc[df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [82]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [7]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

df = pd.DataFrame(data)

In [8]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [105]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [95]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [103]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [9]:
df.groupby('Company').describe().transpose()['FB']['Sales']['count']

2.0

In [17]:
df['Company'] = df['Company'].apply(lambda x: x + '!!')

In [22]:
df.sort_values(by=['Company', 'Person'])

  Company   Person  Sales
4    FB!!     Carl    243
5    FB!!    Sarah    350
1  GOOG!!  Charlie    120
0  GOOG!!      Sam    200
2  MSFT!!      Amy    340
3  MSFT!!  Vanessa    124

In [26]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [25]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [34]:
pdf = df.pivot_table(index=['A', 'B'], columns='C', values = 'D')
pdf

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [39]:
pdf.loc['bar'].loc['one']

C
x    4.0
y    1.0
Name: one, dtype: float64

In [43]:
root_path = '/Users/bbjang/Documents/DataScienceProjects/Refactored_Py_DS_ML_Bootcamp-master/03-Python-for-Data-Analysis-Pandas/'

df = pd.read_csv(root_path + 'example')

In [44]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [56]:
df.to_csv(root_path + 'output', index=False)

In [57]:
pd.read_csv(root_path + 'output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [62]:
exdf = pd.read_excel(root_path + 'Excel_Sample.xlsx', index_col=0)

In [63]:
exdf

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [8]:
df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/07_Visualization/Online_Retail/Online_Retail.csv', encoding='ISO-88591')

In [9]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/10 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/10 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/10 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/10 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/10 8:26,3.39,17850.0,United Kingdom

In [2]:

df = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/US_Crime_Rates/US_Crime_Rates_1960_2014.csv')

In [3]:
df.head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

In [10]:

df.reindex(np.random.permutation(df.index)).head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
45,2005,296507061,11565499,1390745,10174754,16740,94347,417438,862220,2155448,6783447,1235859
6,1966,195576000,5223500,430180,4793300,11040,25820,157990,235330,1410100,2822000,561200
35,1995,262755000,13862700,1798790,12063900,21610,97470,580510,1099210,2593800,7997700,1472400
43,2003,290690788,11826538,1383676,10442862,16528,93883,414235,859030,2154834,7026802,1261226
40,2000,281421906,11608072,1425486,10182586,15586,90178,408016,911706,2050992,6971590,1160002

In [11]:
df.reindex().head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800